The  MEPConnectorInfo  type exposes the following members.
 Properties
Name  |   Description
IsPrimary
 True if this is the primary connector.
IsSecondary
 True if this is the secondary connector.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkedConnector
 The linked connector or    a null reference (  Nothing  in Visual Basic)  if there is no linked connector
 See Also
  MEPConnectorInfo Class
  Autodesk.Revit.DB Namespace